INSERT INTO "Role" (Id, Name)
VALUES
    (1, 'User'),
    (2, 'Admin'),
    (3, 'Moderator')
    ON CONFLICT (Id) DO NOTHING;

INSERT INTO "User" (Email, Password, name, RoleId)
VALUES
    ('admin@gmail.com', 'X3sFq3xWxxUE2K1KWANwGg==;wAKDVZBX4E4Uk2Ry9hA4OBrWwQ5q9FAijbU+Ov0HwtQ=', 'admin', 2),
    ('moderator@gmail.com', 'X3sFq3xWxxUE2K1KWANwGg==;wAKDVZBX4E4Uk2Ry9hA4OBrWwQ5q9FAijbU+Ov0HwtQ=', 'lera', 3),
    ('user1@gmail.com', 'X3sFq3xWxxUE2K1KWANwGg==;wAKDVZBX4E4Uk2Ry9hA4OBrWwQ5q9FAijbU+Ov0HwtQ=', 'mariya', 1),
    ('user2@gmail.com', 'X3sFq3xWxxUE2K1KWANwGg==;wAKDVZBX4E4Uk2Ry9hA4OBrWwQ5q9FAijbU+Ov0HwtQ=', 'ilgiz', 1)
    ON CONFLICT (Email) DO NOTHING;

INSERT INTO Category (slug, "name", description, icon)
VALUES
    ('guides', 'Руководства', 'Пошаговые инструкции и руководства для начинающих и опытных пользователей', '📚'),
    ('support', 'Техническая поддержка', 'Решение технических проблем и ответы на вопросы по настройке', '🔧'),
    ('product-docs', 'Документация продуктов', 'Полная документация по всем продуктам компании', '📋'),
    ('projects', 'Описание проектов', 'Информация о текущих и завершенных проектах компании', '🏢'),
    ('hr', 'Кадровые вопросы', 'Отпуска, больничные, оформление документов', '👥'),
    ('onboarding', 'Онбординг', 'Руководства для новых сотрудников, адаптация в компании', '🎯'),
    ('workflow', 'Рабочие процессы', 'Внутренние процедуры и бизнес-процессы компании', '⚡'),
    ('policies', 'Политики компании', 'Внутренние правила, регламенты и политики', '📜'),
    ('tools', 'Внутренние инструменты', 'Инструкции по использованию корпоративных систем', '🛠️'),
    ('meetings', 'Встречи и совещания', 'Правила проведения встреч, протоколы, отчеты', '📅'),
    ('career', 'Развитие карьеры', 'Обучение, курсы, карьерный рост в компании', '🚀'),
    ('benefits', 'Льготы и benefits', 'Корпоративные benefits, ДМС, компенсации', '⭐')
    ON CONFLICT (slug) DO NOTHING;
